src/Catalogs/КошелькиИСчета/КошелькиИСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КошелькиИСчета</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСчета</name>
    <type>
      <types>EnumRef.ТипыСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьПроцентыНаДепозит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомиссияЗаКредит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДнейЛьготногоПериода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоНачисленияПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляНакоплений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КредитныйЛимит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоАктуальных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНаличных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоНеактуальных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоБезналичных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКредиток</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДляНакоплений</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСвободных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ОбъектыОпераций/ОбъектыОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыОпераций</name>
  <resources>
    <name>СуммаПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделУчета</name>
    <type>
      <types>ChartOfAccountsRef.РазделыУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметУчета</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФинансоваяЦель</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.ТипыБюджетныхПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатистикаСправочников/СтатистикаСправочников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаСправочников</name>
  <comment>Вспомогательная информация для использования в отборах</comment>
  <resources>
    <name>КоличествоНеактуальных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоАктуальных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоПомеченных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВалют</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоСвободных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоДляНакоплений</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоКредиток</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоБезналичных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоНаличных</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВзатыхДолгов</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоВыданныхДолгов</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>CatalogRef.Контакты</types>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.КошелькиИСчета</types>
      <types>CatalogRef.СтатьиДоходов</types>
      <types>CatalogRef.Имущество</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСчетов</name>
  <enumValues>
    <name>Наличность</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКартаДебетовая</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКартаКредитная</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКартаУниверсальная</name>
  </enumValues>
  <enumValues>
    <name>БанковскийСчет</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйКошелек</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/ФинансовыеЦели/ФинансовыеЦели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФинансовыеЦели</name>
  <predefined>
    <items>
      <name>ОбщиеНакопления</name>
      <description>Общие накопления (без указания цели)</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеФинансовойЦели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Срок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНакопления</name>
    <type>
      <types>DocumentRef.Доход</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/ChartsOfAccounts/РазделыУчета/РазделыУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>РазделыУчета</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Деньги</name>
      <description>Деньги</description>
      <code>100</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>СвободныеДеньги</name>
        <description>Свободные деньги</description>
        <code>100.01</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>Накопления</name>
        <description>Накопления</description>
        <code>100.10</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
    <items>
      <name>Имущество</name>
      <description>Имущество</description>
      <code>200</code>
    </items>
    <items>
      <name>Долги</name>
      <description>Долги</description>
      <code>500</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ОсновныеСуммыДолгов</name>
        <description>Основные суммы долгов</description>
        <code>500.10</code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>ПроцентыПоДолгам</name>
        <description>Проценты по долгам</description>
        <code>500.20</code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
    <items>
      <name>Капитал</name>
      <description>Капитал</description>
      <code>900</code>
      <accountType>Passive</accountType>
    </items>
  </predefined>
  <attributes>
    <name>ЗаголовокДляСубконтоПоДебету</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаголовокДляСубконтоПоКредиту</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:ChartOfAccounts>

src/Catalogs/КошелькиИСчета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Врзвращает генерируемое по умолчанию наименование в зависимости от типа кошелька.
//	Если такое наименование уже использовалось, к наименованию добавляется номер
Функция ПолучитьНаименованиеПоУмолчанию(ТипСчета, Валюта) Экспорт

	ВременноеНаименование = "";
	Если ТипСчета = Перечисления.ТипыСчетов.Наличность Тогда
		ВременноеНаименование = "Моя наличность" + ?(Валюта.Пустая(),"",", " + Валюта);
	ИначеЕсли ТипСчета = Перечисления.ТипыСчетов.БанковскаяКартаДебетовая
		ИЛИ ТипСчета = Перечисления.ТипыСчетов.БанковскаяКартаКредитная
		ИЛИ ТипСчета = Перечисления.ТипыСчетов.БанковскаяКартаУниверсальная Тогда
		ВременноеНаименование = "Моя банковская карта" + ?(Валюта.Пустая(),"",", " + Валюта);
	ИначеЕсли ТипСчета = Перечисления.ТипыСчетов.БанковскийСчет Тогда
		ВременноеНаименование = "Мой счет" + ?(Валюта.Пустая(),"",", " + Валюта);
	ИначеЕсли ТипСчета = Перечисления.ТипыСчетов.ЭлектронныйКошелек Тогда
		ВременноеНаименование = "Мой электронный кошелек" + ?(Валюта.Пустая(),"",", " + Валюта);
	ИначеЕсли ТипСчета = Перечисления.ТипыСчетов.Прочее Тогда
		ВременноеНаименование = "Мои деньги" + ?(Валюта.Пустая(),"",", " + Валюта);
	Иначе
		ВременноеНаименование = "Мои деньги" + ?(Валюта.Пустая(),"",", " + Валюта);
	КонецЕсли;

	// Проверяем наличие наименования:
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Наименование", ВременноеНаименование + "%");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(КошелькиИСчета.Наименование) КАК Наименование
	|ИЗ
	|	Справочник.КошелькиИСчета КАК КошелькиИСчета
	|ГДЕ
	|	КошелькиИСчета.Наименование ПОДОБНО &Наименование";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ВременноеНаименование;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	СущесвтующееИмя = Выборка.Наименование;
	
	РазницаВНаименовании = СокрЛП(СтрЗаменить(СущесвтующееИмя, ВременноеНаименование, ""));
	
	Если ПустаяСтрока(РазницаВНаименовании) 
		Или НЕ СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(РазницаВНаименовании, Истина, Ложь) Тогда
		Возврат ВременноеНаименование + " 2";
	Иначе
		Возврат ВременноеНаименование + " " + Формат(Число(РазницаВНаименовании) + 1, "ЧДЦ=0; ЧГ=");
	КонецЕсли; 
	
КонецФункции

// Изменяет реквизиты и, при необходимости, перепроводит операции, в которых используется указанный в парамтерах кошелек
//	Необходимо выполнять при изменении назначения кошелька и при изменении типа счета с (или на) кредитной карты
//
//Параметры:
//	Кошелек - СправочникСсылка.КошелькиИСчета - кошелек, в котором изменилось назначение или "кредитность"
//	ИзменятьРазделУчета - Булево - признак необходимости изменять раздел учета и финансовую цель
//	НеРегистрироватьВОбмене - Булево - отключает регистрацию изменений в планах обмена
//
Процедура ИсправитьОперацииПоНовомуНазначениюКошелька(Кошелек, ИзменятьРазделУчета, НеРегистрироватьВОбмене = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Кошелек", Кошелек);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОбъектыОпераций.Операция,
	|	ТИПЗНАЧЕНИЯ(ОбъектыОпераций.Операция) КАК ТипОперации
	|ИЗ
	|	РегистрСведений.ОбъектыОпераций КАК ОбъектыОпераций
	|ГДЕ
	|	ОбъектыОпераций.ПредметУчета = &Кошелек
	|
	|СГРУППИРОВАТЬ ПО
	|	ОбъектыОпераций.Операция
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОбъектыОпераций.Операция.Дата,
	|	ОбъектыОпераций.Операция.Ссылка";
	
	// раздел учета и финансовая цель меняется только если указано в параметрах:
	Если ИзменятьРазделУчета Тогда
		
		Если Кошелек.ИспользоватьДляНакоплений  Тогда
			ОбщиеНакопления = Справочники.ФинансовыеЦели.ОбщиеНакопления;
			РазделУчета = ПланыСчетов.РазделыУчета.Накопления;
		Иначе
			ОбщиеНакопления = Справочники.ФинансовыеЦели.ПустаяСсылка();
			РазделУчета = ПланыСчетов.РазделыУчета.СвободныеДеньги;
		КонецЕсли;
		
	КонецЕсли;
	
	ВыборкаОпераций = Запрос.Выполнить().Выбрать();
	Пока ВыборкаОпераций.Следующий() Цикл
		
		ОбъектОперации = ВыборкаОпераций.Операция.ПолучитьОбъект();
		
		Если ИзменятьРазделУчета Тогда
			
			Если ВыборкаОпераций.ТипОперации = Тип("ДокументСсылка.ВводИзменениеОстатка") Тогда
				
				ОбъектОперации.РазделУчета = РазделУчета;
				ОбъектОперации.ФинансоваяЦель = ОбщиеНакопления;
				
			ИначеЕсли ВыборкаОпераций.ТипОперации = Тип("ДокументСсылка.МыДалиВДолг") Тогда
				
				ОбъектОперации.ФинансоваяЦель = ОбщиеНакопления;
				Для Каждого СтрокаДопРасходов Из ОбъектОперации.ДополнительныеРасходы Цикл
					Если СтрокаДопРасходов.КошелекРасхода = Кошелек Тогда
						СтрокаДопРасходов.ФинансоваяЦель = ОбщиеНакопления;
					КонецЕсли; 
				КонецЦикла; 
				
			ИначеЕсли ВыборкаОпераций.ТипОперации = Тип("ДокументСсылка.НамВернулиДолг") Тогда
				
				ОбъектОперации.ФинансоваяЦель = ОбщиеНакопления;
				Для Каждого СтрокаДопРасходов Из ОбъектОперации.ДополнительныеРасходы Цикл
					Если СтрокаДопРасходов.КошелекРасхода = Кошелек Тогда
						СтрокаДопРасходов.ФинансоваяЦель = ОбщиеНакопления;
					КонецЕсли; 
				КонецЦикла; 
				
			ИначеЕсли ВыборкаОпераций.ТипОперации = Тип("ДокументСсылка.ОбменВалюты") Тогда
				
				Если ОбъектОперации.КошелекОткуда = Кошелек Тогда
					ОбъектОперации.ФинансоваяЦельОткуда = ОбщиеНакопления;
				КонецЕсли; 
				Если ОбъектОперации.КошелекКуда = Кошелек Тогда
					ОбъектОперации.ФинансоваяЦельКуда = ОбщиеНакопления;
				КонецЕсли; 
				Для Каждого СтрокаДопРасходов Из ОбъектОперации.ДополнительныеРасходы Цикл
					Если СтрокаДопРасходов.КошелекРасхода = Кошелек Тогда
						СтрокаДопРасходов.ФинансоваяЦель = ОбщиеНакопления;
					КонецЕсли; 
				КонецЦикла; 
				
			ИначеЕсли ВыборкаОпераций.ТипОперации = Тип("ДокументСсылка.Перемещение") Тогда
				
				Если ОбъектОперации.КошелекОткуда = Кошелек Тогда
					ОбъектОперации.СчетОткуда = РазделУчета;
					ОбъектОперации.ФинансоваяЦельОткуда = ОбщиеНакопления;
				КонецЕсли; 
				Если ОбъектОперации.КошелекКуда = Кошелек Тогда
					ОбъектОперации.СчетКуда = РазделУчета;
					ОбъектОперации.ФинансоваяЦельКуда = ОбщиеНакопления;
				КонецЕсли; 
				Для Каждого СтрокаДопРасходов Из ОбъектОперации.ДополнительныеРасходы Цикл
					Если СтрокаДопРасходов.КошелекРасхода = Кошелек Тогда
						СтрокаДопРасходов.ФинансоваяЦель = ОбщиеНакопления;
					КонецЕсли; 
				КонецЦикла; 
				
			ИначеЕсли ВыборкаОпераций.ТипОперации = Тип("ДокументСсылка.МыВернулиДолг") Тогда
				
				ОбъектОперации.ФинансоваяЦель = ОбщиеНакопления;
				Для Каждого СтрокаДопРасходов Из ОбъектОперации.ДополнительныеРасходы Цикл
					Если СтрокаДопРасходов.КошелекРасхода = Кошелек Тогда
						СтрокаДопРасходов.ФинансоваяЦель = ОбщиеНакопления;
					КонецЕсли; 
				КонецЦикла; 
				
			ИначеЕсли ВыборкаОпераций.ТипОперации = Тип("ДокументСсылка.МыВзялиВДолг") Тогда
				
				ОбъектОперации.ФинансоваяЦель = ОбщиеНакопления;
				Для Каждого СтрокаДопРасходов Из ОбъектОперации.ДополнительныеРасходы Цикл
					Если СтрокаДопРасходов.КошелекРасхода = Кошелек Тогда
						СтрокаДопРасходов.ФинансоваяЦель = ОбщиеНакопления;
					КонецЕсли; 
				КонецЦикла; 
				
			ИначеЕсли ВыборкаОпераций.ТипОперации = Тип("ДокументСсылка.Доход") Тогда
				
				Для Каждого СтрокаДокумента Из ОбъектОперации.Доходы Цикл
					Если СтрокаДокумента.Кошелек = Кошелек Тогда
						СтрокаДокумента.ФинансоваяЦель = ОбщиеНакопления;
					КонецЕсли; 
				КонецЦикла; 
				
			ИначеЕсли ВыборкаОпераций.ТипОперации = Тип("ДокументСсылка.Расход") Тогда
				
				ОбъектОперации.КошелекДолг = Кошелек;
				ОбъектОперации.РазделУчета = РазделУчета;
				
				Для Каждого СтрокаДокумента Из ОбъектОперации.Расходы Цикл
					СтрокаДокумента.ФинансоваяЦель = ОбщиеНакопления;
				КонецЦикла; 
				
			ИначеЕсли ВыборкаОпераций.ТипОперации = Тип("ДокументСсылка.УниверсальнаяОперация") Тогда
				
				Для Каждого СтрокаДокумента Из ОбъектОперации.Доходы Цикл
					Если СтрокаДокумента.ОбъектУчета = Кошелек Тогда
						СтрокаДокумента.РазделУчета = РазделУчета;
						СтрокаДокумента.ФинансоваяЦель = ОбщиеНакопления;
					КонецЕсли; 
				КонецЦикла; 
				
				Для Каждого СтрокаДокумента Из ОбъектОперации.Расходы Цикл
					Если СтрокаДокумента.ОбъектУчета = Кошелек Тогда
						СтрокаДокумента.РазделУчета = РазделУчета;
						СтрокаДокумента.ФинансоваяЦель = ОбщиеНакопления;
					КонецЕсли; 
				КонецЦикла; 
				
				Для Каждого СтрокаДокумента Из ОбъектОперации.Перемещения Цикл
					Если СтрокаДокумента.ОбъектУчетаДт = Кошелек Тогда
						СтрокаДокумента.РазделУчетаДт = РазделУчета;
						СтрокаДокумента.ФинансоваяЦельДт = ОбщиеНакопления;
					КонецЕсли; 
					Если СтрокаДокумента.ОбъектУчетаКт = Кошелек Тогда
						СтрокаДокумента.РазделУчетаКт = РазделУчета;
						СтрокаДокумента.ФинансоваяЦельКт = ОбщиеНакопления;
					КонецЕсли; 
				КонецЦикла; 
				
			Иначе
				Продолжить;
			КонецЕсли; 
			
		КонецЕсли;
		
		// Устанавливаем запрет на обработку последовательности, т.к. перепроводятся все документы в хронологическом порядке
		ОбъектОперации.ДополнительныеСвойства.Вставить("НеВосстанавливатьПоследовательность", Истина);
		
		// Если указано, отключаем регистрацию в журнале обмена
		Если НеРегистрироватьВОбмене Тогда
			ОбъектОперации.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
		КонецЕсли;
		
		ОбъектОперации.Записать(?(ОбъектОперации.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
	
	КонецЦикла;

КонецПроцедуры

// Обновляет информационные реквизиты по указанному или всем кошелькам
//	в регистре сведений "СтатистикаСправочников".
//Перед использованием необходимо актуализировать ключи статей.
//
//Параметры:
//	Ссылка - СправочникСсылка или Неопределено 
//
Процедура ОбновитьРегистрСтатистики(Ссылка = Неопределено) Экспорт
	
	РегистрыСведений.СтатистикаСправочников.ОбновитьСтатистикуСправочника("КошелькиИСчета", Ссылка);
	
КонецПроцедуры


#КонецОбласти



#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	// Проверяем/устанавливаем стандартные параметры отбора
	ОбслуживаниеСправочников.ПроверитьСтандартныеПараметрыОтбора(Параметры);
	
	// Если в параметрах есть необходимые ключи/значения будет выполнена расширенная обработка получения данных
	ОбслуживаниеСправочников.ВыполнитьРасширенноеПолучениеДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		
		Если НЕ Параметры.Свойство("Ключ") ИЛИ НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
			СтандартнаяОбработка = Ложь;
			ВыбраннаяФорма = "Обработка.ПомощникСозданияКошелька.Форма";
		КонецЕсли;
		
	ИначеЕсли ВидФормы = "ФормаВыбора" ИЛИ ВидФормы = "ФормаВыбораГруппы" Тогда 
		
		ОбслуживаниеСправочников.ОбработкаПолученияФормыВыбора(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
		
	КонецЕсли;

КонецПроцедуры


#КонецОбласти

#КонецЕсли
